# -*- coding: utf-8 -*-

"""
可以輸入一週7天所花費的零用金,
並將每一天所花費的零用金輸出,
並統計總花費及平均每天的零用金花費。
"""

name = input("請輸入姓名：")
day1 = input("請輸入第一天的零用金總花費：")
day2 = input("請輸入第二天的零用金總花費：")
day3 = input("請輸入第三天的零用金總花費：")
day4 = input("請輸入第四天的零用金總花費：")
day5 = input("請輸入第五天的零用金總花費：")
day6 = input("請輸入第六天的零用金總花費：")
day7 = input("請輸入第七天的零用金總花費：")


print("{0:<8}{1:^5}{2:^5}{3:^5}{4:^5}{5:^5}{6:^5}{7:^5}". \
      format("name","day1","day2","day3", \
             "day4","day5","day6", \
             "day7"))
print("{0:<8}{1:^5}{2:^5}{3:^5}{4:^5}{5:^5}{6:^5}{7:^5}". \
      format(name,day1,day2,day3,day4,day5,day6,day7))
